ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/timer_capture/svd/MLDR187_rev1.svd
<?xml version='1.0' encoding='utf-8' standalone='no'?>
<device schemaVersion="1.1"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>MLDR187</name>
    <version>1.4</version>
    <description>MLDR187. Rev1</description>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>0x20</size>
    <cpu>
        <name>MDR32F02</name>
        <endian>little</endian>
    </cpu>
    <peripherals>
        <peripheral>
            <name>CLINT</name>
            <description>CLINT description</description>
            <groupName>CLINT</groupName>
            <baseAddress>0x02000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTMSIP</name>
                    <displayName>CTMSIP</displayName>
                    <description>CTMSIP description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CTMTIMECMP</name>
                    <displayName>CTMTIMECMP</displayName>
                    <description>CTMTIMECMP description</description>
                    <addressOffset>0x00004000</addressOffset>
                    <size>0x40</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CTMTIME</name>
                    <displayName>CTMTIME</displayName>
                    <description>CTMTIME description</description>
                    <addressOffset>0x0000BFF8</addressOffset>
                    <size>0x40</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PLIC</name>
            <description>PLIC description</description>
            <groupName>PLIC</groupName>
            <baseAddress>0x0C000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PLPRI1</name>
                    <displayName>PLPRI1</displayName>
                    <description>PLPRI1 description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI2</name>
                    <displayName>PLPRI2</displayName>
                    <description>PLPRI2 description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI3</name>
                    <displayName>PLPRI3</displayName>
                    <description>PLPRI3 description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI4</name>
                    <displayName>PLPRI4</displayName>
                    <description>PLPRI4 description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI5</name>
                    <displayName>PLPRI5</displayName>
                    <description>PLPRI5 description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI6</name>
                    <displayName>PLPRI6</displayName>
                    <description>PLPRI6 description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI7</name>
                    <displayName>PLPRI7</displayName>
                    <description>PLPRI7 description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI8</name>
                    <displayName>PLPRI8</displayName>
                    <description>PLPRI8 description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI9</name>
                    <displayName>PLPRI9</displayName>
                    <description>PLPRI9 description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI10</name>
                    <displayName>PLPRI10</displayName>
                    <description>PLPRI10 description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI11</name>
                    <displayName>PLPRI11</displayName>
                    <description>PLPRI11 description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI12</name>
                    <displayName>PLPRI12</displayName>
                    <description>PLPRI12 description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI13</name>
                    <displayName>PLPRI13</displayName>
                    <description>PLPRI13 description</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI14</name>
                    <displayName>PLPRI14</displayName>
                    <description>PLPRI14 description</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI15</name>
                    <displayName>PLPRI15</displayName>
                    <description>PLPRI15 description</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI16</name>
                    <displayName>PLPRI16</displayName>
                    <description>PLPRI16 description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI17</name>
                    <displayName>PLPRI17</displayName>
                    <description>PLPRI17 description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI18</name>
                    <displayName>PLPRI18</displayName>
                    <description>PLPRI18 description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI19</name>
                    <displayName>PLPRI19</displayName>
                    <description>PLPRI19 description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI20</name>
                    <displayName>PLPRI20</displayName>
                    <description>PLPRI20 description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI21</name>
                    <displayName>PLPRI21</displayName>
                    <description>PLPRI21 description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI22</name>
                    <displayName>PLPRI22</displayName>
                    <description>PLPRI22 description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI23</name>
                    <displayName>PLPRI23</displayName>
                    <description>PLPRI23 description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI24</name>
                    <displayName>PLPRI24</displayName>
                    <description>PLPRI24 description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI25</name>
                    <displayName>PLPRI25</displayName>
                    <description>PLPRI25 description</description>
                    <addressOffset>0x00000064</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI26</name>
                    <displayName>PLPRI26</displayName>
                    <description>PLPRI26 description</description>
                    <addressOffset>0x00000068</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI27</name>
                    <displayName>PLPRI27</displayName>
                    <description>PLPRI27 description</description>
                    <addressOffset>0x0000006C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI28</name>
                    <displayName>PLPRI28</displayName>
                    <description>PLPRI28 description</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI29</name>
                    <displayName>PLPRI29</displayName>
                    <description>PLPRI29 description</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLPRI30</name>
                    <displayName>PLPRI30</displayName>
                    <description>PLPRI30 description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>PRI description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
