ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/timer_capture/svd/MLDR187_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RST_CLK</name>
            <description>RST_CLK description</description>
            <groupName>RST_CLK</groupName>
            <baseAddress>0x40020000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CLOCK_STATUS</name>
                    <displayName>CLOCK_STATUS</displayName>
                    <description>CLOCK_STATUS description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PLL_CPU_RDY</name>
                            <description>PLL_CPU_RDY description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE_RDY</name>
                            <description>HSE_RDY description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL_CONTROL</name>
                    <displayName>PLL_CONTROL</displayName>
                    <description>PLL_CONTROL description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PLL_CPU_ON</name>
                            <description>PLL_CPU_ON description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL_CPU_SEL</name>
                            <description>PLL_CPU_SEL description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL_CPU_MUL</name>
                            <description>PLL_CPU_MUL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HS_CONTROL</name>
                    <displayName>HS_CONTROL</displayName>
                    <description>HS_CONTROL description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>HSE_ON</name>
                            <description>HSE_ON description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE_BYP</name>
                            <description>HSE_BYP description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPU_CLOCK</name>
                    <displayName>CPU_CLOCK</displayName>
                    <description>CPU_CLOCK description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CPU_C1_SEL</name>
                            <description>CPU_C1_SEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CPU_C2_SEL</name>
                            <description>CPU_C2_SEL description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CPU_C3_SEL</name>
                            <description>CPU_C3_SEL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HCLK_SEL</name>
                            <description>HCLK_SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PER1_CLOCK</name>
                    <displayName>PER1_CLOCK</displayName>
                    <description>PER1_CLOCK description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PER1_C1_SEL</name>
                            <description>PER1_C1_SEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PER1_C2_SEL</name>
                            <description>PER1_C2_SEL description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>KEY_RESET_PROG</name>
                            <description>KEY_RESET_PROG description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN</name>
                            <description>DMA_EN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDG_C1_SEL</name>
                            <description>WDG_C1_SEL description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WDG_C2_SEL</name>
                            <description>WDG_C2_SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WDG_BGR</name>
                            <description>WDG_BGR description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WDG_CLK_EN</name>
                            <description>WDG_CLK_EN description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_CLOCK</name>
                    <displayName>ADC_CLOCK</displayName>
                    <description>ADC_CLOCK description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ADC_C1_SEL</name>
                            <description>ADC_C1_SEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADCIU_C1_SEL</name>
                            <description>ADCIU_C1_SEL description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADCIU_C3_SEL</name>
                            <description>ADCIU_C3_SEL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADC_C3_SEL</name>
                            <description>ADC_C3_SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADCIU_CLK_EN</name>
                            <description>ADCIU_CLK_EN description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC_CLK_EN</name>
                            <description>ADC_CLK_EN description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CLOCK</name>
                    <displayName>RTC_CLOCK</displayName>
                    <description>RTC_CLOCK description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>HSE_SEL</name>
                            <description>HSE_SEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HSI_SEL</name>
                            <description>HSI_SEL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HSE_RTC_EN</name>
                            <description>HSE_RTC_EN description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI_RTC_EN</name>
                            <description>HSI_RTC_EN description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PER2_CLOCK</name>
                    <displayName>PER2_CLOCK</displayName>
                    <description>PER2_CLOCK description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PCLK_EN_SSP1</name>
                            <description>PCLK_EN_SSP1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART1</name>
                            <description>PCLK_EN_UART1 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART2</name>
                            <description>PCLK_EN_UART2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_EEPROM</name>
                            <description>PCLK_EN_EEPROM description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_RST_CLK</name>
                            <description>PCLK_EN_RST_CLK description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_DMA</name>
                            <description>PCLK_EN_DMA description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_I2C</name>
                            <description>PCLK_EN_I2C description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART3</name>
                            <description>PCLK_EN_UART3 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_ADC</name>
                            <description>PCLK_EN_ADC description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_WWDG</name>
                            <description>PCLK_EN_WWDG description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_IWDG</name>
                            <description>PCLK_EN_IWDG description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_POWER</name>
                            <description>PCLK_EN_POWER description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_BKP</name>
                            <description>PCLK_EN_BKP description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_ADCIU</name>
                            <description>PCLK_EN_ADCIU description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER1</name>
                            <description>PCLK_EN_TIMER1 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER2</name>
                            <description>PCLK_EN_TIMER2 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTA</name>
                            <description>PCLK_EN_PORTA description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTB</name>
                            <description>PCLK_EN_PORTB description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTC</name>
                            <description>PCLK_EN_PORTC description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_CRC</name>
                            <description>PCLK_EN_CRC description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_SENSORS</name>
                            <description>PCLK_EN_SENSORS description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_CLK_MEASURE</name>
                            <description>PCLK_EN_CLK_MEASURE description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_RANDOM</name>
                            <description>PCLK_EN_RANDOM description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_ISO7816</name>
                            <description>PCLK_EN_ISO7816 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_SSP2</name>
                            <description>PCLK_EN_SSP2 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_SSP3</name>
                            <description>PCLK_EN_SSP3 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER3</name>
                            <description>PCLK_EN_TIMER3 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER4</name>
                            <description>PCLK_EN_TIMER4 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART4</name>
                            <description>PCLK_EN_UART4 description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTD</name>
                            <description>PCLK_EN_PORTD description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
