ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/timer_capture/svd/MLDR187_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SBLOCK0</name>
            <description>SBLOCK0 description</description>
            <groupName>SBLOCK0</groupName>
            <baseAddress>0x60008000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TRM_00</name>
                    <displayName>TRM_00</displayName>
                    <description>Transformation register 0</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_01</name>
                    <displayName>TRM_01</displayName>
                    <description>Transformation register 1</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_02</name>
                    <displayName>TRM_02</displayName>
                    <description>Transformation register 2</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_03</name>
                    <displayName>TRM_03</displayName>
                    <description>Transformation register 3</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_04</name>
                    <displayName>TRM_04</displayName>
                    <description>Transformation register 0</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_05</name>
                    <displayName>TRM_05</displayName>
                    <description>Transformation register 1</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_06</name>
                    <displayName>TRM_06</displayName>
                    <description>Transformation register 2</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_07</name>
                    <displayName>TRM_07</displayName>
                    <description>Transformation register 3</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TABLE_CHG</name>
                    <displayName>TABLE_CHG</displayName>
                    <description>Table change register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TABLE_VAL_0</name>
                            <description>TABLE_VAL_0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_1</name>
                            <description>TABLE_VAL_1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_2</name>
                            <description>TABLE_VAL_2 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_3</name>
                            <description>TABLE_VAL_3 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M_SCTRL</name>
                    <displayName>M_SCTRL</displayName>
                    <description>Memory special control</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="SBLOCK0">
            <name>SBLOCK1</name>
            <description>SBLOCK1 description</description>
            <groupName>SBLOCK1</groupName>
            <baseAddress>0x6000C000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SBLOCK0">
            <name>SBLOCK2</name>
            <description>SBLOCK2 description</description>
            <groupName>SBLOCK2</groupName>
            <baseAddress>0x60010000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SBLOCK0">
            <name>SBLOCK3</name>
            <description>SBLOCK3 description</description>
            <groupName>SBLOCK3</groupName>
            <baseAddress>0x60014000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SBLOCK0">
            <name>SBLOCK4</name>
            <description>SBLOCK4 description</description>
            <groupName>SBLOCK4</groupName>
            <baseAddress>0x60018000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SBLOCK0">
            <name>SBLOCK5</name>
            <description>SBLOCK5 description</description>
            <groupName>SBLOCK5</groupName>
            <baseAddress>0x6001C000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SBLOCK0">
            <name>SBLOCK6</name>
            <description>SBLOCK6 description</description>
            <groupName>SBLOCK6</groupName>
            <baseAddress>0x60020000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SBLOCK0">
            <name>SBLOCK7</name>
            <description>SBLOCK7 description</description>
            <groupName>SBLOCK7</groupName>
            <baseAddress>0x60024000</baseAddress>
        </peripheral>
        <peripheral>
            <name>LBLOCK</name>
            <description>LBLOCK description</description>
            <groupName>LBLOCK</groupName>
            <baseAddress>0x60004000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TRM_00</name>
                    <displayName>TRM_00</displayName>
                    <description>Transformation register 0</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_01</name>
                    <displayName>TRM_01</displayName>
                    <description>Transformation register 1</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_02</name>
                    <displayName>TRM_02</displayName>
                    <description>Transformation register 2</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRM_03</name>
                    <displayName>TRM_03</displayName>
                    <description>Transformation register 3</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TABLE_CHG_00</name>
                    <displayName>TABLE_CHG_00</displayName>
                    <description>Table change 0 register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TABLE_VAL_00</name>
                            <description>TABLE_VAL_00 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_01</name>
                            <description>TABLE_VAL_01 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_02</name>
                            <description>TABLE_VAL_02 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_03</name>
                            <description>TABLE_VAL_03 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TABLE_CHG_01</name>
                    <displayName>TABLE_CHG_01</displayName>
                    <description>Table change 1 register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TABLE_VAL_10</name>
                            <description>TABLE_VAL_10 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_11</name>
                            <description>TABLE_VAL_11 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_12</name>
                            <description>TABLE_VAL_12 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_13</name>
                            <description>TABLE_VAL_13 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TABLE_CHG_02</name>
                    <displayName>TABLE_CHG_02</displayName>
                    <description>Table change 2 register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TABLE_VAL_20</name>
                            <description>TABLE_VAL_20 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_21</name>
                            <description>TABLE_VAL_21 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_22</name>
                            <description>TABLE_VAL_22 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_23</name>
                            <description>TABLE_VAL_23 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TABLE_CHG_03</name>
                    <displayName>TABLE_CHG_03</displayName>
                    <description>Table change 3 register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TABLE_VAL_30</name>
                            <description>TABLE_VAL_30 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_31</name>
                            <description>TABLE_VAL_31 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_32</name>
                            <description>TABLE_VAL_32 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_33</name>
                            <description>TABLE_VAL_33 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SETUP</name>
                    <displayName>SETUP</displayName>
                    <description>Setup register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SET_R_COUNT</name>
                            <description>SET_R_COUNT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CURR_R_COUNT</name>
                            <description>CURR_R_COUNT description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SET_L_DIR</name>
                            <description>SET_L_DIR description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CURR_L_DIR</name>
                            <description>CURR_L_DIR description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M_SCTRL</name>
                    <displayName>M_SCTRL</displayName>
                    <description>Memory special control</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
