ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/timer_capture/svd/MLDR187_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>P_BIT0</name>
            <description>P_BIT0 description</description>
            <groupName>P_BIT0</groupName>
            <baseAddress>0x6002C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TRANSFORM_0</name>
                    <displayName>TRANSFORM_0</displayName>
                    <description>Transformation register 0</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_1</name>
                    <displayName>TRANSFORM_1</displayName>
                    <description>Transformation register 0</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_2</name>
                    <displayName>TRANSFORM_2</displayName>
                    <description>Transformation register 0</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_3</name>
                    <displayName>TRANSFORM_3</displayName>
                    <description>Transformation register 0</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MUX_SET</name>
                    <displayName>MUX_SET</displayName>
                    <description>Transformation setup register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IN_SEL</name>
                            <description>Zapis' zadaet perestanovku IN_SEL -&gt; OUT_SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OUT_SEL</name>
                            <description>Zapis' zadaet perestanovku IN_SEL -&gt; OUT_SEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUX_VAL</name>
                    <displayName>MUX_VAL</displayName>
                    <description>Transformation value register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Pri chtenii iz dannogo polja vozvraszaetsja znachenie perestanovki dlja vybrannogo cherez SEL vyhodnogo bita.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>Zapis' v dannoe pole zadaet vyhodnoj bit, dlja kotorogo bude vozvraszeno znachenie perestanovki pri chtenii registra.</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="P_BIT0">
            <name>P_BIT1</name>
            <description>P_BIT1 description</description>
            <groupName>P_BIT1</groupName>
            <baseAddress>0x60030000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="P_BIT0">
            <name>P_BIT2</name>
            <description>P_BIT2 description</description>
            <groupName>P_BIT2</groupName>
            <baseAddress>0x60034000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="P_BIT0">
            <name>P_BIT3</name>
            <description>P_BIT3 description</description>
            <groupName>P_BIT3</groupName>
            <baseAddress>0x60038000</baseAddress>
        </peripheral>
        <peripheral>
            <name>RANDOM</name>
            <description>RANDOM description</description>
            <groupName>RANDOM</groupName>
            <baseAddress>0x400B8000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>STAT_CTRL_REG</name>
                    <displayName>STAT_CTRL_REG</displayName>
                    <description>Status and control register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN_STATE</name>
                            <description>EN_STATE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>BUSY description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UNREAD_DATA</name>
                            <description>UNREAD_DATA description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MASK</name>
                            <description>MASK description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WORK_MODE</name>
                            <description>WORK_MODE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BIT_CN</name>
                            <description>BIT_CN description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_CTRL_REG</name>
                    <displayName>INT_CTRL_REG</displayName>
                    <description>Interrupt control register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INT_EN</name>
                            <description>INT_EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UNREAD_DATA</name>
                            <description>UNREAD_DATA description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_DIV_REG</name>
                    <displayName>CLK_DIV_REG</displayName>
                    <description>Clock divider</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PAUSE_REG</name>
                    <displayName>PAUSE_REG</displayName>
                    <description>Pause register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUTPUT_REG</name>
                    <displayName>OUTPUT_REG</displayName>
                    <description>Output random</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>PAUSE_CNT_REG</name>
                    <displayName>PAUSE_CNT_REG</displayName>
                    <description>Pause counter</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>TEMP_REG</name>
                    <displayName>TEMP_REG</displayName>
                    <description>Temp random register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
